"use strict";
// актуальний суровий режим, потрібно записувати завжди, уникає помилки і контролює код



// let number = 5;
// // Значення можна змінити
// const leftBorderWidth = 1;
// // Стале значення

// number = 10;
// // Зміна значення let
// console.log(number);


// const obj = {
//     a: 50
// };
// obj.a = 10;
// console.log(obj);
// // Прямих констант не буває, можна вносити зміни, якщо константа це певний об'єкт


// var name = "Makar";
// // змінна, яка відома вже заздалегідь


// // ТИПИ ДАНИХ //////////////////////////////////////////////////////////////////////////////////
// let number = 4.6;

// // Числа
// console.log(4 / 0);
// console.log("stirng" * 9);

// // Рядок
// const persone = "Alex";

// // Булінове значення
// const bool = true;

// // null щось, чого не існує
// console.log(something);

// // undefined коли в контейнері нічого немає
// let und;
// console.log(und);


// // ОБ'ЄКТИ /////////////////////////////////////////////////////////////////////////////////////
// const obj = {
//     name: "John",
//     age: 25,
//     isMarried: false
// };

// console.log(obj.name);
// // console.log(obj["name"]);


// // МАСИВИ //////////////////////////////////////////////////////////////////////////////////////
// let arr = ["plum.png", "orange.jpg", 6, "apple:bmp", {}, []];
// console.log(arr[1]);


// // КОМАНДИ /////////////////////////////////////////////////////////////////////////////////////
// alert("Hello");

// const result = confirm("Are you here?");
// console.log(result);

// const answer = prompt("Are you 18?", "19");
// // В лапках плейсхолдер
// console.log(answer);

// const answers = [];
// answers[0] = prompt("What is your name?", "");
// answers[1] = prompt("What is your surname?", "");
// answers[2] = prompt("How old are you?", "");
// console.log(typeof (answers));


// // ІНТЕРПОЛЯЦІЯ ////////////////////////////////////////////////////////////////////////////////
// const category = "toys";
// console.log(`https:://someurl.com/${category}/5`);
// // інтерполяція працює тільки з косими лапками

// const user = "John";
// alert(`Hello, ${user}`);


// // ОПЕРАТОРИ ///////////////////////////////////////////////////////////////////////////////////
// console.log('arr' + " - object");
// // в результаті отримуємо повноцінний рядок 
// console.log(4 + " - object");
// // не зважаючи на число, результат все одно виходить як рядок
// console.log(4 + +"5");
// // при одному + два числа записуються разом, при двох - математична дія 
// // плюс, який ставиться безпосередньо перед об'єктом, називається "унарним"

// Інкримент і Дикримент (укорочують або збільшують код) //////////////////////////////////////////
let incr = 10,
    decr = 10;

// Постфіксний запис
incr++;
decr--;
// // Префіксний запис
// ++incr;
// --decr;

console.log(incr);
console.log(decr);
// якщо прописати одразу ж в консоль без зазначень попередньо постфіксний чи префіксний (incr++),
// то постфіксний перейме задані вище дані, а префіксний відповідно зменшить або збільшить.

// console.log(5%2); в консолі відобразиться залишок після дії 5:2

// console.log(2*4 == 8); 2*= це порівняння, 1 - присвоєння
// console.log(2*4 == '8'); порівняння з 'рядком' функціонує також, так як порівнюється по значенню, а не типу данних.
// console.log(2*4 === '8'); строге порівняння, через різний тип данних не пройде

// && оператор "і"
// || оперетор "або"
const isChecked = true,
    isClose = false;
console.log(isChecked || isClose);

// "!" оператор зрікання (надає константі протилежне значення)
//  console.log(isChecked || !isClose); - результат буде true true





